Core/src/Documents/ДоговорКредитаИЗайма/ДоговорКредитаИЗайма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДоговорКредитаИЗайма</name>
  <basedOn>Catalog.Сотрудники</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ГрафикПогашенияКредитовИЗаймов</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоКредитамИЗаймам</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКредитаИЗайма</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументРеализации</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавкаГодовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаРасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПогашатьИзЗаработнойПлаты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПогашения</name>
    <type>
      <types>EnumRef.ВариантыПогашенияЗаймаСотрудником</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредоставления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПроцентов</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКомиссии</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКомиссии</name>
    <type>
      <types>EnumRef.ТипыКомиссииКредитовИЗаймов</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПлатежей</name>
    <type>
      <types>EnumRef.ВидыПлатежейПогашенияКредитаИЗайма</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>УдержаниеОсновнойДолг</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>УдержаниеПроценты</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ВГоду360Дней</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаПроцентовРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКомиссииРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВключаетНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРаспределенияДоходов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДохода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачислитьПроценты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикПлатежейИНачислений</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОсновногоДолга</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПроцентов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаКомиссии</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПлатежа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/AccumulationRegisters/РасчетыСПокупателями/РасчетыСПокупателями.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыСПокупателями</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРег</name>
    <comment>Сумма в регламентированной валюте</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетов</name>
    <type>
      <types>EnumRef.ТипыРасчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.ПередачаВА</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ПоступлениеВКассу</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
      <types>DocumentRef.Взаимозачет</types>
      <types>DocumentRef.ПоступлениеНаСчет</types>
      <types>DocumentRef.ОперацияПоПлатежнымКартам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПриемИПередачаВРемонт</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетов</name>
  <enumValues>
    <name>Долг</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыДоговоровКредитаИЗайма/ВидыДоговоровКредитаИЗайма.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКредитаИЗайма</name>
  <enumValues>
    <name>ДоговорЗаймаСотруднику</name>
  </enumValues>
  <enumValues>
    <name>КредитПолученный</name>
  </enumValues>
  <enumValues>
    <name>КредитВыданный</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ДоговорКредитаИЗайма/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВалютаРасчетов");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства) Экспорт
	
	//Lazare 21.01.2025 ONESOFT-3786
	ЭтоКредитПоРеализации = ТипЗнч(ДокументСсылкаДоговорКредита.ДокументРеализации) = Тип("ДокументСсылка.РасходнаяНакладная") и
	ДокументСсылкаДоговорКредита.ДокументРеализации.Проведен;
	//Lazare 21.01.2025 ONESOFT-3786
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаДоговорКредита);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ВалютаРасчетов", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылкаДоговорКредита, "ВалютаРасчетов"));	
	Запрос.УстановитьПараметр("ЭтоКредитПоРеализации", ЭтоКредитПоРеализации);//Lazare 21.01.2025 ONESOFT-3786

	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс КАК Курс,
	|	КурсыВалютСрезПоследних.Кратность КАК Кратность
	|ПОМЕСТИТЬ ВременнаяТаблицаКурсыВалютСрезПоследних
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта В (&ВалютаУчета, &ВалютаРасчетов)) КАК КурсыВалютСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.Ссылка КАК Ссылка,
	|	СУММА(ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.СуммаОсновногоДолга) КАК СуммаОсновногоДолга,
	|	СУММА(ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.СуммаПроцентов) КАК СуммаПроцентов
	|ПОМЕСТИТЬ ВременнаяТаблицаГрафикПлатежей
	|ИЗ
	|	Документ.ДоговорКредитаИЗайма.ГрафикПлатежейИНачислений КАК ДоговорКредитаИЗаймаГрафикПлатежейИНачислений
	|ГДЕ
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорКредитаИЗайма.Ссылка КАК Ссылка,
	|	ДоговорКредитаИЗайма.Дата КАК Дата,
	|	ДоговорКредитаИЗайма.ВидДоговора КАК ВидДоговора,
	|	ДоговорКредитаИЗайма.Контрагент КАК Контрагент,
	|	ДоговорКредитаИЗайма.ДокументРеализации.Договор КАК Договор,
	|	ДоговорКредитаИЗайма.ДокументРеализации КАК Документ,
	|	ДоговорКредитаИЗайма.НачислитьПроценты КАК НачислитьПроценты,
	//--------------------------------------------------------------------------
	// © Шишка В.В. [4 декабря 2023]  НАЧАЛО
	//|	ЕСТЬNULL(ДоговорКредитаИЗайма.ДокументРеализации.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)) КАК Заказ,
	|	ВЫБОР
	|   	КОГДА ТИПЗНАЧЕНИЯ(ДоговорКредитаИЗайма.ДокументРеализации) = ТИП(Документ.ЗаказПокупателя) ТОГДА
	|			ДоговорКредитаИЗайма.ДокументРеализации
	|		ИНАЧЕ 
	|			ЕСТЬNULL(ДоговорКредитаИЗайма.ДокументРеализации.Заказ, ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка))
	|	КОНЕЦ  КАК Заказ,	
	// © Шишка В.В. [4 декабря 2023]  КОНЕЦ
	//--------------------------------------------------------------------------
	|	ЕСТЬNULL(ДоговорКредитаИЗайма.Контрагент.ВестиРасчетыПоДокументам, ЛОЖЬ) КАК ВестиРасчетыПоДокументам,
	|	ЕСТЬNULL(ДоговорКредитаИЗайма.Контрагент.ВестиРасчетыПоЗаказам, ЛОЖЬ) КАК ВестиРасчетыПоЗаказам,
	|	ДоговорКредитаИЗайма.ВалютаРасчетов КАК ВалютаРасчетов,
	|	ДоговорКредитаИЗайма.СуммаДокумента КАК СуммаВал,
	|	ВЫРАЗИТЬ(ДоговорКредитаИЗайма.СуммаДокумента * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ЕСТЬNULL(ВременнаяТаблицаГрафикПлатежей.СуммаОсновногоДолга, 0) КАК СуммаОсновногоДолгаВал,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаГрафикПлатежей.СуммаОсновногоДолга, 0) * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаОсновногоДолга,
	|	ЕСТЬNULL(ВременнаяТаблицаГрафикПлатежей.СуммаПроцентов, 0) КАК СуммаПроцентовВал,
	|	ВЫРАЗИТЬ(ЕСТЬNULL(ВременнаяТаблицаГрафикПлатежей.СуммаПроцентов, 0) * КурсыВалютУчета.Кратность * КурсыВалютРасчетов.Курс / (КурсыВалютУчета.Курс * КурсыВалютРасчетов.Кратность) КАК ЧИСЛО(15, 2)) КАК СуммаПроцентов,
	|	ДоговорКредитаИЗайма.СчетУчета КАК СчетУчета,
	|	ДоговорКредитаИЗайма.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ДоговорКредитаИЗайма.Контрагент.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ДоговорКредитаИЗайма.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ДоговорКредитаИЗайма.СчетУчетаПроцентов КАК СчетУчетаПроцентов,
	|	ДоговорКредитаИЗайма.СчетУчетаПроцентовРегл КАК СчетУчетаПроцентовРегл
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	ВременнаяТаблицаГрафикПлатежей КАК ВременнаяТаблицаГрафикПлатежей
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДоговорКредитаИЗайма КАК ДоговорКредитаИЗайма
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютРасчетов
	|			ПО ДоговорКредитаИЗайма.ВалютаРасчетов = КурсыВалютРасчетов.Валюта
	|			ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|			ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ПО ВременнаяТаблицаГрафикПлатежей.Ссылка = ДоговорКредитаИЗайма.Ссылка
	|ГДЕ
	|	ДоговорКредитаИЗайма.Ссылка = &Ссылка	
	|	И &ЭтоКредитПоРеализации";
	
	Запрос.Выполнить();
	
	СформироватьТаблицаГрафикПогашенияКредитовИЗаймов(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства);
	СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ДоговорКредитаИЗайма(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства);
	
КонецПроцедуры

// Получает договор контрагента по умолчанию с учетом условий отбора. Возвращается основной договор или единственный или пустую ссылку.
//
// Параметры
//  Контрагент	–	<СправочникСсылка.Контрагенты> 
//							Контрагент, договор которого нужно получить
//  Организация	–	<СправочникСсылка.Организации> 
//							Организация, договор которой нужно получить
//  СписокВидовДоговора	–	<Массив> или <СписокЗначений>, состоящий из значений типа <ПеречислениеСсылка.ВидыДоговоров> 
//							Нужные виды договора
//
// Возвращаемое значение:
//   <СправочникСсылка.ДоговорыКонтрагентов> – найденный договор или пустая ссылка
//
Функция ПолучитьДоговорКредитаИЗаймаПоУмолчаниюПоОрганизацииВидуДоговора(Контрагент, Организация, СписокВидовДоговора = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДоговорКредитаИЗайма.Ссылка
	|ИЗ
	|	Документ.ДоговорКредитаИЗайма КАК ДоговорКредитаИЗайма
	|ГДЕ
	|	ДоговорКредитаИЗайма.Контрагент = &Контрагент
	|	И ДоговорКредитаИЗайма.Организация = &Организация
	|	И ДоговорКредитаИЗайма.Проведен"
	+?(СписокВидовДоговора <> Неопределено,"
	|	И ДоговорКредитаИЗайма.ВидДоговора В (&СписокВидовДоговора)","");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СписокВидовДоговора", СписокВидовДоговора);
	
	Если ТипЗнч(Контрагент) = Тип("СправочникСсылка.Сотрудники") Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДоговорКредитаИЗайма.Контрагент = &Контрагент", "ДоговорКредитаИЗайма.Сотрудник = &Контрагент");
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 1 
	   И Выборка.Следующий()
	Тогда
		ДоговорКредитаИЗайма = Выборка.Ссылка;
	Иначе
		ДоговорКредитаИЗайма = Неопределено;
	КонецЕсли;
	
	Возврат ДоговорКредитаИЗайма;
	
КонецФункции // ПолучитьДоговорКредитаИЗаймаПоУмолчаниюПоОрганизацииВидуДоговора()

Функция СчетаУчетаПоУмолчанию(Организация, Период, ВидДоговора) Экспорт
	
	СчетаУчета = НовыйСчетаУчета();
	
	Если Не ЗначениеЗаполнено(ВидДоговора) Тогда
		Возврат СчетаУчета;
	КонецЕсли;
	
	ВидДоговораСтрокой = ВидДоговораКредитаЗаймаСтрокой(ВидДоговора);
	
	ИменаРесурсовУчетнойПолитики = ИменаРесурсовУчетнойПолитикиСчетаУчета(СчетаУчета, ВидДоговора);
	
	ЗначенияСчетов = РегистрыСведений.УчетнаяПолитикаРегл.ЗначенияПолейУчетнойПолитики(
		ИменаРесурсовУчетнойПолитики,
		Организация,
		Период);
	
	Для Каждого КлючИЗначение Из СчетаУчета Цикл
		СчетаУчета[КлючИЗначение.Ключ] = ЗначенияСчетов[КлючИЗначение.Ключ + ВидДоговораСтрокой];
	КонецЦикла;
	
	Возврат СчетаУчета;
	
КонецФункции

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаДоговорКредита, ДополнительныеСвойства, Отказ) Экспорт
	
	Если Не Константы.КонтролироватьОстаткиПриПроведении.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Если Не СтруктураВременныеТаблицы.ДвиженияРасчетыСПокупателямиИзменение Тогда
		Возврат;
	КонецЕсли;
	
	// Временные таблицы содержат записи - необходимо выполнить контроль отрицательных остатков.
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДвиженияРасчетыСПокупателямиИзменение.НомерСтроки КАК НомерСтроки,
	|	ДвиженияРасчетыСПокупателямиИзменение.Организация КАК ОрганизацияПредставление,
	|	ДвиженияРасчетыСПокупателямиИзменение.Контрагент КАК КонтрагентПредставление,
	|	ДвиженияРасчетыСПокупателямиИзменение.Договор КАК ДоговорПредставление,
	|	ДвиженияРасчетыСПокупателямиИзменение.Договор.ВалютаРасчетов КАК ВалютаПредставление,
	|	ДвиженияРасчетыСПокупателямиИзменение.Документ КАК ДокументПредставление,
	|	ДвиженияРасчетыСПокупателямиИзменение.Заказ КАК ЗаказПредставление,
	|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетовПредставление,
	|	ИСТИНА КАК ДвиженияДенежныхДокументов,
	|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
	|	ДвиженияРасчетыСПокупателямиИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
	|	ДвиженияРасчетыСПокупателямиИзменение.СуммаИзменение КАК СуммаИзменение,
	|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
	|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
	|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
	|	ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаОстаткаЗадолженности,
	|	-(ДвиженияРасчетыСПокупателямиИзменение.СуммаВалИзменение + ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0)) КАК СуммаНепогашенныхАвансов,
	|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) КАК СуммаВалОстаток,
	|	ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ДвиженияРасчетыСПокупателямиИзменение КАК ДвиженияРасчетыСПокупателямиИзменение
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РасчетыСПокупателями.Остатки(&МоментКонтроля, ) КАК РасчетыСПокупателямиОстатки
	|		ПО ДвиженияРасчетыСПокупателямиИзменение.Организация = РасчетыСПокупателямиОстатки.Организация
	|			И ДвиженияРасчетыСПокупателямиИзменение.Контрагент = РасчетыСПокупателямиОстатки.Контрагент
	|			И ДвиженияРасчетыСПокупателямиИзменение.Договор = РасчетыСПокупателямиОстатки.Договор
	|			И ДвиженияРасчетыСПокупателямиИзменение.Документ = РасчетыСПокупателямиОстатки.Документ
	|			И ДвиженияРасчетыСПокупателямиИзменение.Заказ = РасчетыСПокупателямиОстатки.Заказ
	|			И ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = РасчетыСПокупателямиОстатки.ТипРасчетов
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ДвиженияРасчетыСПокупателямиИзменение.ТипРасчетов = ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Аванс)
	|				ТОГДА ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) > 0
	|			ИНАЧЕ ЕСТЬNULL(РасчетыСПокупателямиОстатки.СуммаВалОстаток, 0) < 0
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВыборкаОшибок = РезультатЗапроса.Выбрать();
	
	ДокументОбъектДоговорКредита = ДокументСсылкаДоговорКредита.ПолучитьОбъект();
	
	УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструРасчетыСПокупателями(
		ДокументОбъектДоговорКредита,
		ВыборкаОшибок,
		Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьТаблицаГрафикПогашенияКредитовИЗаймов(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаДоговорКредита);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.Ссылка КАК ДоговорКредитаЗайма,
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.Период,
	//--------------------------------------------------------------------------
	// © Шишка В.В. [23 ноября 2022]  НАЧАЛО
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.Проект,
	// © Шишка В.В. [23 ноября 2022]  КОНЕЦ
	//--------------------------------------------------------------------------
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.СуммаОсновногоДолга,
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.СуммаПроцентов,
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.СуммаКомиссии
	|ИЗ
	|	Документ.ДоговорКредитаИЗайма.ГрафикПлатежейИНачислений КАК ДоговорКредитаИЗаймаГрафикПлатежейИНачислений
	|ГДЕ
	|	ДоговорКредитаИЗаймаГрафикПлатежейИНачислений.Ссылка = &Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаГрафикПогашенияКредитовИЗаймов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыСПокупателями(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства)
	
	//Малышев 2024-06-10 ONESOFT-2926
	Если не ЗначениеЗаполнено(ДокументСсылкаДоговорКредита.ДокументРеализации) 
		и ДокументСсылкаДоговорКредита.ГрафикПлатежейИНачислений.Количество()>0 
		Тогда
			СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Новый ТаблицаЗначений);
			Возврат;	
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаДоговорКредита);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("СодержаниеПроводкиПереносДолга",
		НСтр("ka='სესხის დავალიანების გადაცემა სესხის დავალიანებაზე';ru='Перенос долга на расчеты по кредиту';en='Transfer of debt to loan debt'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	&СодержаниеПроводкиПереносДолга КАК СодержаниеПроводки,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоДокументам
	|			ТОГДА ТаблицаДокумента.Документ
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Документ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.ВестиРасчетыПоЗаказам
	|			ТОГДА ТаблицаДокумента.Заказ
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|	КОНЕЦ КАК Заказ,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НачислитьПроценты
	|			ТОГДА ТаблицаДокумента.СуммаОсновногоДолга + ТаблицаДокумента.СуммаПроцентов
	|		ИНАЧЕ ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НачислитьПроценты
	|			ТОГДА ТаблицаДокумента.СуммаОсновногоДолгаВал + ТаблицаДокумента.СуммаПроцентовВал
	|		ИНАЧЕ ТаблицаДокумента.СуммаВал
	|	КОНЕЦ КАК СуммаВал,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НачислитьПроценты
	|			ТОГДА -(ТаблицаДокумента.СуммаОсновногоДолга + ТаблицаДокумента.СуммаПроцентов)
	|		ИНАЧЕ -ТаблицаДокумента.Сумма
	|	КОНЕЦ КАК СуммаДляОстатка,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НачислитьПроценты
	|			ТОГДА -(ТаблицаДокумента.СуммаОсновногоДолгаВал + ТаблицаДокумента.СуммаПроцентовВал)
	|		ИНАЧЕ -ТаблицаДокумента.СуммаВал
	|	КОНЕЦ КАК СуммаВалДляОстатка
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыСПокупателями
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный)
	|	И ТаблицаДокумента.Документ <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Контрагент,
	|	Договор,
	|	Валюта,
	|	Документ,
	|	Заказ,
	|	ТипРасчетов,
	|	СчетУчета";
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков расчетов с контрагентами.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаРасчетыСПокупателями.Организация КАК Организация,
	|	ВременнаяТаблицаРасчетыСПокупателями.Контрагент КАК Контрагент,
	|	ВременнаяТаблицаРасчетыСПокупателями.Договор КАК Договор,
	|	ВременнаяТаблицаРасчетыСПокупателями.Документ КАК Документ,
	|	ВременнаяТаблицаРасчетыСПокупателями.Заказ КАК Заказ,
	|	ВременнаяТаблицаРасчетыСПокупателями.ТипРасчетов КАК ТипРасчетов
	|ИЗ
	|	ВременнаяТаблицаРасчетыСПокупателями";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.РасчетыСПокупателями");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателями(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	// Щербаков +++
	Запрос.Текст = Запрос.Текст + ";" + УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыСПокупателямиРегл(Запрос.МенеджерВременныхТаблиц, Ложь, НомерЗапроса);
	// Щербаков ---
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

// Формирует таблицу значений, содержащую данные для проведения по регистру РасчетыПоКредитамИЗаймам.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаРасчетыПоКредитамИЗаймам(ДокументСсылкаДоговорКредита, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("УчетРасчетовПоКредитамВыданным", НСтр("ka='კრედიტი მყიდველს';ru='Выдача кредита покупателю';en='Issuance of the loan to the buyer'"));
	Запрос.УстановитьПараметр("УчетРасчетовПоНачисленнымПроцентам",
		НСтр("ka='კრედიტის (გაცემული) თაობაზე დარიცხულია პროცენტები';ru='Начислены проценты по кредиту (выданному)';en='Chargeable loan interest (iccued)'"));
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаДоговорКредита);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница';en='Exchange difference'"));
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.ВидДоговора КАК ВидДоговора,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ТаблицаДокумента.Дата КАК Период,
	|	&УчетРасчетовПоКредитамВыданным КАК СодержаниеПроводки,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаВал КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВал,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Сумма КАК ЧИСЛО(15, 2)) КАК ОсновнойДолг,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаВал КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгВалДляОстатка,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Сумма КАК ЧИСЛО(15, 2)) КАК ОсновнойДолгДляОстатка,
	|	0 КАК ПроцентыВал,
	|	0 КАК Проценты,
	|	0 КАК ПроцентыВалДляОстатка,
	|	0 КАК ПроцентыДляОстатка,
	|	0 КАК КомиссияВал,
	|	0 КАК Комиссия,
	|	0 КАК КомиссияВалДляОстатка,
	|	0 КАК КомиссияДляОстатка,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаВал КАК ЧИСЛО(15, 2)) КАК СуммаВал,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Сумма КАК ЧИСЛО(15, 2)) КАК Сумма,
	|	ТаблицаДокумента.Ссылка КАК ДоговорКредитаЗайма,
	|	ТаблицаДокумента.ВалютаРасчетов КАК Валюта,
	|	ТаблицаДокумента.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ЛОЖЬ КАК УдержаноИзЗарплаты,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта) КАК Проект,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем КАК СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Контрагент КАК Контрагент,
	|	ТаблицаДокумента.Договор КАК Договор
	|ПОМЕСТИТЬ ВременнаяТаблицаРасчетыПоКредитамИЗаймам
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговора
	|		ПО (КурсыВалютДоговора.Валюта = ТаблицаДокумента.ВалютаРасчетов)
	|ГДЕ
	|	ТаблицаДокумента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный)
	|	И ТаблицаДокумента.Документ <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|	И НЕ ТаблицаДокумента.НачислитьПроценты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.ВидДоговора,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Дата,
	|	&УчетРасчетовПоКредитамВыданным,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаОсновногоДолгаВал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаОсновногоДолга КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаОсновногоДолгаВал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаОсновногоДолга КАК ЧИСЛО(15, 2)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаВал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Сумма КАК ЧИСЛО(15, 2)),
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчета,
	|	ТаблицаДокумента.СчетУчетаРегл,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговора
	|		ПО (КурсыВалютДоговора.Валюта = ТаблицаДокумента.ВалютаРасчетов)
	|ГДЕ
	|	ТаблицаДокумента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный)
	|	И ТаблицаДокумента.Документ <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|	И ТаблицаДокумента.НачислитьПроценты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	ТаблицаДокумента.ВидДоговора,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Дата,
	|	&УчетРасчетовПоНачисленнымПроцентам,
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПроцентовВал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПроцентов КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПроцентовВал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаПроцентов КАК ЧИСЛО(15, 2)),
	|	0,
	|	0,
	|	0,
	|	0,
	|	ВЫРАЗИТЬ(ТаблицаДокумента.СуммаВал КАК ЧИСЛО(15, 2)),
	|	ВЫРАЗИТЬ(ТаблицаДокумента.Сумма КАК ЧИСЛО(15, 2)),
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.ВалютаРасчетов,
	|	ТаблицаДокумента.СчетУчетаПроцентов,
	|	ТаблицаДокумента.СчетУчетаПроцентовРегл,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта),
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателем,
	|	ТаблицаДокумента.СчетУчетаРасчетовСПокупателемРегл,
	|	ТаблицаДокумента.Контрагент,
	|	ТаблицаДокумента.Договор
	|ИЗ
	|	ТаблицаДокумента КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютУчета
	|		ПО (КурсыВалютУчета.Валюта = &ВалютаУчета)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаКурсыВалютСрезПоследних КАК КурсыВалютДоговора
	|		ПО (КурсыВалютДоговора.Валюта = ТаблицаДокумента.ВалютаРасчетов)
	|ГДЕ
	|	ТаблицаДокумента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКредитаИЗайма.КредитВыданный)
	|	И ТаблицаДокумента.Документ <> ЗНАЧЕНИЕ(Документ.РасходнаяНакладная.ПустаяСсылка)
	|	И ТаблицаДокумента.НачислитьПроценты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НомерЗапроса = 0;
	
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыРасчетыПоКредитамИЗаймамРегл(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаРасчетыПоКредитамИЗаймам", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры

#Область СчетаУчета

Функция НовыйСчетаУчета()
	
	СчетаУчета = Новый Структура;
	
	СчетаУчета.Вставить("СчетУчетаРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	СчетаУчета.Вставить("СчетУчетаПроцентовРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	СчетаУчета.Вставить("СчетУчетаКомиссииРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	СчетаУчета.Вставить("СчетЗатратРегл", ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	
	Возврат СчетаУчета;
	
КонецФункции

Функция ИменаРесурсовУчетнойПолитикиСчетаУчета(СчетаУчета, ВидДоговора)
	
	ИменаРесурсов = Новый Массив;
	
	ВидДоговораСтрокой = ВидДоговораКредитаЗаймаСтрокой(ВидДоговора);
	
	Для Каждого КлючИЗначение Из СчетаУчета Цикл
		ИменаРесурсов.Добавить(КлючИЗначение.Ключ + ВидДоговораСтрокой);
	КонецЦикла;
	
	Возврат ИменаРесурсов;
	
КонецФункции

Функция ВидДоговораКредитаЗаймаСтрокой(ВидДоговора)
	
	Возврат ОбщегоНазначения.ИмяЗначенияПеречисления(ВидДоговора);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
